In [28]:
import mysql.connector

config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'ssl_verify_cert': False
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [2]:
raman.execute("create database Placement_Portal")

In [29]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [4]:
## Create Student table to store the basic information

raman.execute("""CREATE TABLE IF NOT EXISTS student_table
              (student_id INT, name varchar(60),
             age int, gender varchar(6),
             email varchar(55), phone varchar(35),
             enrollment_year int, course_batch varchar (10),
             city varchar(45), graduation_year int,
             CONSTRAINT pk_student PRIMARY KEY (student_id) );""")

print("Student table has been created successfully")

Student table has been created successfully

In [5]:
## Create Programming table to store the basic information

raman.execute("""CREATE TABLE IF NOT EXISTS programming_table(programming_id int, 
                             student_id int,
                             language varchar(35), problems_solved int,
                             assessments_completed int,   mini_projects int,
                             certifications_earned int, latest_project_score int,
                             PRIMARY KEY (programming_id),
                             CONSTRAINT fk_programme FOREIGN KEY (student_id)
                             REFERENCES student_table(student_id));""")

print("Programming Table has been created successfully")

Programming Table has been created successfully

In [7]:
## Create Soft Skill table to store the basic information

raman.execute("""CREATE TABLE IF NOT EXISTS soft_skill_table(soft_skill_id int,
             student_id int, communication int, team_work int,
             presentation int, leadership int,
             critical_thinking int, interpersonal_skill int,
             PRIMARY KEY (soft_skill_id),
             CONSTRAINT fk_softskill FOREIGN KEY (student_id) REFERENCES student_table(student_id));""")

print("Soft Skill table has been created successfully")

Soft Skill table has been created successfully

In [31]:
## Create Placement Table to store the basic information

raman.execute(""" CREATE TABLE IF NOT EXISTS placement_table
              (placement_id INT PRIMARY KEY AUTO_INCREMENT,
              student_id int, mock_interview_score int,
              internships_completed int, placement_status varchar(20),
              company_name varchar(100), placement_package int,
              interview_rounds_cleared int, placement_date date,
              FOREIGN KEY (student_id)
              REFERENCES student_table(student_id));""")

print("Placement Table has been created successfully")

Placement Table has been created successfully

In [9]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [10]:
!pip install faker mysql-connector-python
import pandas as pd
import mysql.connector
from faker import Faker
import random

fake = Faker()

Requirement already satisfied: faker in d:\vscode\.venv\lib\site-packages (37.4.0)
Requirement already satisfied: mysql-connector-python in d:\vscode\.venv\lib\site-packages (9.3.0)
Requirement already satisfied: tzdata in d:\vscode\.venv\lib\site-packages (from faker) (2025.2)

In [11]:
## Student Data kept ready for use 
data = []

for i in range(200):
    student_id = f"{100 + i}"
    name = fake.name()
    age = random.randint(18, 25)
    gender = random.choice(['Male', 'Female','Others'])
    email = fake.email()
    phone = fake.msisdn()[:10]  # Trim to 10 digits
    enrollment_year = random.choice([2018, 2019, 2020, 2021])
    course_batch = random.choice(['CS-A', 'IT-B', 'ME-C', 'EC-D', 'CE-E'])
    city = fake.city()
    graduation_year = enrollment_year + 4

    data.append([student_id, name, age, gender, email, phone,
                 enrollment_year, course_batch, city, graduation_year])

columns = ['student_id', 'name', 'age', 'gender', 'email', 'phone',
           'enrollment_year', 'course_batch', 'city', 'graduation_year']

student_df = pd.DataFrame(data, columns=columns)
student_df.head()

print("Data inserted into Student Table successfully")

Data inserted into Student Table successfully

In [12]:
student_df.to_csv('student_table.csv', index=False)  # Data saved to Student_table

In [14]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [15]:
## Data inserted into Student table
for _, row in student_df.iterrows():
    values = tuple(row[col] for col in columns)
    raman.execute("""
        INSERT INTO student_table (
            student_id, name, age, gender, email, phone,
            enrollment_year, course_batch, city, graduation_year
        ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s);
    """, values)

sethu.commit()

print("Data inserted into Student Table successfully")

Data inserted into Student Table successfully

In [16]:
!pip install faker mysql-connector-python
import pandas as pd
import mysql.connector
from faker import Faker
import random

fake = Faker()

Requirement already satisfied: faker in d:\vscode\.venv\lib\site-packages (37.4.0)
Requirement already satisfied: mysql-connector-python in d:\vscode\.venv\lib\site-packages (9.3.0)
Requirement already satisfied: tzdata in d:\vscode\.venv\lib\site-packages (from faker) (2025.2)

In [17]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [18]:
# Data kept ready for use for Programming table
data1 = []

for i in range(200):
    programming_id = f"{1000 + i}"
    student_id = f"{100 + i}"
    language = random.choice(["Python", "Java", "C++", "JavaScript", "Go", "Rust"])
    problems_solved = random.randint(1, 20)
    assessments_completed = random.randint(2, 8)
    mini_projects = random.randint(1, 5)
    certifications_earned = random.randint(0, 3)
    latest_project_score = random.randint(40, 100)

    data1.append([programming_id, student_id, language, problems_solved,
                  assessments_completed, mini_projects, certifications_earned, latest_project_score])


columns = ['programming_id', 'student_id', 'language', 'problems_solved',
                  'assessments_completed', 'mini_projects', 'certifications_earned', 'latest_project_score']


programming_df = pd.DataFrame(data1, columns=columns)
programming_df.head()

print("Data for Programming Table has been created")

Data for Programming Table has been created

In [19]:
programming_df.to_csv('programming_table.csv', index=False) # Data saved to a file named programming_table

In [20]:
## Establising connection with sql 

config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [21]:
# Data insertion to Programming Table

for _, row in programming_df.iterrows():
    values = tuple(row[col] for col in columns)
    raman.execute("""
        INSERT INTO programming_table(programming_id, student_id,
        language, problems_solved,
        assessments_completed, mini_projects, certifications_earned, latest_project_score
        ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s);
    """, values)

sethu.commit()

print("Data inserted into Programming Table")

Data inserted into Programming Table

In [22]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [23]:
!pip install faker mysql-connector-python
import pandas as pd
import mysql.connector
from faker import Faker
import random

fake = Faker()

Requirement already satisfied: faker in d:\vscode\.venv\lib\site-packages (37.4.0)
Requirement already satisfied: mysql-connector-python in d:\vscode\.venv\lib\site-packages (9.3.0)
Requirement already satisfied: tzdata in d:\vscode\.venv\lib\site-packages (from faker) (2025.2)

In [24]:
# Data generation for Soft skill Table

data2 = []

for i in range(200):

    soft_skill_id = f"{2000 + i}"
    student_id = f"{100 + i}"
    communication = random.randint(40, 100)
    team_work = random.randint(40, 100)
    presentation = random.randint(40, 100)
    leadership = random.randint(40, 100)
    critical_thinking = random.randint(40, 100)
    interpersonal_skill = random.randint(40, 100)

    data2.append([soft_skill_id, student_id, communication, team_work,
                  presentation, leadership, critical_thinking, interpersonal_skill])


columns = ['soft_skill_id', 'student_id', 'communication', 'team_work',
                  'presentation', 'leadership', 'critical_thinking', 'interpersonal_skill']


soft_skill_df = pd.DataFrame(data2, columns=columns)
soft_skill_df.head()

print("Data for Soft Skill table has been created")

Data for Soft Skill table has been created

In [25]:
soft_skill_df.to_csv('soft_skill_table.csv', index=False) # Data saved to a file named soft_skill_table

In [26]:
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [27]:
# Data insertion into Soft skill table

for _, row in soft_skill_df.iterrows():
    values = tuple(row[col] for col in columns)
    raman.execute("""
        INSERT INTO soft_skill_table(soft_skill_id, student_id,
        communication, team_work, presentation, leadership,
        critical_thinking, interpersonal_skill
        ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s);
    """, values)

sethu.commit()

print("Data inserted into soft Skill table")

Data inserted into soft Skill table

In [16]:
import mysql.connector
## Establising connection with sql 
config = {
    'host': 'gateway01.ap-southeast-1.prod.aws.tidbcloud.com',
    'port': 4000,
    'user': '31ZrixPLoJcBFtY.root',
    'password': 'xAwaevomY9b1ldSM',
    'database': 'Placement_Portal'
    
}

sethu = mysql.connector.connect(**config)
raman = sethu.cursor()

In [15]:
!pip install faker mysql-connector-python
import pandas as pd
import mysql.connector
from faker import Faker
import random
from datetime import date
fake = Faker()

Requirement already satisfied: faker in d:\vscode\.venv\lib\site-packages (37.4.0)
Requirement already satisfied: mysql-connector-python in d:\vscode\.venv\lib\site-packages (9.3.0)
Requirement already satisfied: tzdata in d:\vscode\.venv\lib\site-packages (from faker) (2025.2)

In [52]:
raman.execute("DELETE FROM placement_table;")
sethu.commit()
print("Existing data in placement_table has been deleted.")

Existing data in placement_table has been deleted.

In [7]:
import pandas as pd
import random
from datetime import datetime, timedelta

# Assume student IDs are from 101 to 300 (total 200 students)
student_ids = list(range(101, 301))

# Generate dummy performance data for programming and soft skills
programming_data = {
    'student_id': student_ids,
    'problems_solved': [random.randint(5, 20) for _ in student_ids],
    'assessments_completed': [random.randint(2, 8) for _ in student_ids],
    'mini_projects': [random.randint(1, 5) for _ in student_ids]
}

soft_skill_data = {
    'student_id': student_ids,
    'communication': [random.randint(5, 10) for _ in student_ids],
    'team_work': [random.randint(5, 10) for _ in student_ids],
    'presentation': [random.randint(5, 10) for _ in student_ids],
    'leadership': [random.randint(5, 10) for _ in student_ids],
    'critical_thinking': [random.randint(5, 10) for _ in student_ids],
    'interpersonal_skill': [random.randint(5, 10) for _ in student_ids]
}

programming_df = pd.DataFrame(programming_data)
softskill_df = pd.DataFrame(soft_skill_data)

# Merge both datasets
merged_df = pd.merge(programming_df, softskill_df, on='student_id')

# Calculate eligibility scores
merged_df['programming_score'] = (
    (merged_df['problems_solved'] / 15) * 0.4 +
    (merged_df['assessments_completed'] / 5) * 0.3 +
    (merged_df['mini_projects'] / 3) * 0.3
).clip(upper=1.0)

merged_df['soft_skill_score'] = (
    merged_df[['communication', 'team_work', 'presentation',
               'leadership', 'critical_thinking', 'interpersonal_skill']].mean(axis=1) / 10
)

merged_df['final_score'] = (
    (merged_df['programming_score'] + merged_df['soft_skill_score']) / 2
) * 100

# Placement eligibility
merged_df['mock_interview_score'] = [random.randint(40, 95) for _ in merged_df.index]
merged_df['internships_completed'] = [random.randint(0, 3) for _ in merged_df.index]

# Define placement status
def determine_status(score):
    if score >= 80:
        return "Placed"
    elif score >= 70:
        return "Ready"
    else:
        return "Not Ready"

merged_df['placement_status'] = merged_df['final_score'].apply(determine_status)

# Add placement details for 'Placed'
companies = ['TCS', 'Wipro', 'Infosys', 'Google', 'Microsoft', 'Amazon', 'Capgemini', 'IBM']

def get_company(row):
    return random.choice(companies) if row['placement_status'] == 'Placed' else None

def get_package(row):
    return random.randint(6, 30) if row['placement_status'] == 'Placed' else None

def get_rounds(row):
    return random.randint(2, 5) if row['placement_status'] == 'Placed' else None

def get_date(row):
    return (datetime.today() - timedelta(days=random.randint(1, 30))).date() if row['placement_status'] == 'Placed' else None

merged_df['company_name'] = merged_df.apply(get_company, axis=1)
merged_df['placement_package'] = merged_df.apply(get_package, axis=1)
merged_df['interview_rounds_cleared'] = merged_df.apply(get_rounds, axis=1)
merged_df['placement_date'] = merged_df.apply(get_date, axis=1)

# Final placement DataFrame
placement_df = merged_df[[
    'student_id', 'mock_interview_score', 'internships_completed',
    'placement_status', 'company_name', 'placement_package',
    'interview_rounds_cleared', 'placement_date'
]]

In [8]:
placement_df = placement_df.where(pd.notnull(placement_df), None)

In [12]:
# Load valid student_ids from student_table
raman.execute("SELECT student_id FROM student_table")
valid_ids = set([row[0] for row in raman.fetchall()])

# Filter placement_df to keep only valid student_ids
placement_df = placement_df[placement_df['student_id'].isin(valid_ids)]

In [17]:
for _, row in placement_df.iterrows():
    raman.execute("""
        INSERT INTO placement_table (
            student_id, mock_interview_score, internships_completed,
            placement_status, company_name, placement_package,
            interview_rounds_cleared, placement_date
        )
        VALUES (%s, %s, %s, %s, %s, %s, %s, %s)
    """, (
        int(row['student_id']),
        int(row['mock_interview_score']) if pd.notna(row['mock_interview_score']) else None,
        int(row['internships_completed']) if pd.notna(row['internships_completed']) else None,
        row['placement_status'],
        row['company_name'] if pd.notna(row['company_name']) else None,
        int(row['placement_package']) if pd.notna(row['placement_package']) else None,
        int(row['interview_rounds_cleared']) if pd.notna(row['interview_rounds_cleared']) else None,
        str(row['placement_date']) if pd.notna(row['placement_date']) else None
    ))

sethu.commit()
raman.close()

print("200 Records inserted successfully into Placement Table.")

200 Records inserted successfully into Placement Table.

In [19]:
placement_df

,student_id,mock_interview_score,internships_completed,placement_status,company_name,placement_package,interview_rounds_cleared,placement_date
0,101,47,3,Ready,None,NaN,NaN,None
1,102,74,2,Placed,Wipro,10.0,2.0,2025-06-22
2,103,71,1,Placed,Amazon,22.0,3.0,2025-07-03
3,104,77,0,Placed,Amazon,21.0,4.0,2025-07-21
4,105,49,1,Ready,None,NaN,NaN,None
...,...,...,...,...,...,...,...,...
194,295,44,2,Placed,Capgemini,19.0,5.0,2025-06-26
195,296,71,0,Placed,Capgemini,11.0,4.0,2025-07-17
196,297,45,3,Placed,Infosys,11.0,2.0,2025-07-17
197,298,54,3,Placed,Microsoft,16.0,2.0,2025-07-21
198,299,94,1,Placed,Amazon,29.0,5.0,2025-06-24

In [20]:
placement_df.to_csv('placement_table.csv', index=False)  # Data saved to Placement_table

In [21]:
merged_df.to_csv('merged_table.csv', index=False)  # Data saved to Merged table